--修复在梦中    永志不渝

DELETE FROM `creature_ai_scripts` WHERE `creature_id` = 3644;
DELETE FROM `creature_ai_scripts` WHERE `creature_id` = 3667;

DELETE FROM `creature_ai_texts` WHERE `entry` = -661;
DELETE FROM `creature_ai_texts` WHERE `entry` = -662;
DELETE FROM `creature_ai_texts` WHERE `entry` = -663;
DELETE FROM `creature_ai_texts` WHERE `entry` = -664;
DELETE FROM `creature_ai_texts` WHERE `entry` = -665;
DELETE FROM `creature_ai_texts` WHERE `entry` = -554;

UPDATE `creature_template` SET AIName='SmartAI' WHERE `entry` = 3644;
UPDATE `creature_template` SET AIName='SmartAI' WHERE `entry` = 3667;

DELETE FROM `creature_text` WHERE `entry` = 3667;
INSERT INTO `creature_text` VALUES
(3667,0,0,"终于, 我的灵魂得到解脱... 啊, 亲爱的塞瑞利恩...",12,0,100,1,0,0,"3667_say0"),                
(3667,1,0,"岁月对我和你都很残酷，我的爱人......但最后我们还是重逢了。",12,0,100,25,0,0,"3667_say1"),
(3667,2,0,"亲爱的，不要为此而感到内疚。你使我从无尽的苦楚和折磨中解脱了出来，我只会为此而更加爱你。",12,0,100,0,0,0,"3667_say2"),
(3667,3,0,"但是，即使是这经过数千年的奋力才换来的重逢也是如此短暂......我和这个世界的连接正在逐渐减弱，我正在慢慢离开它......离开你......",12,0,100,0,0,0,"3667_say3"),
(3667,4,0,"再见了，塞瑞利恩，我的爱人。我们终能再见......",12,0,100,0,0,0,"3667_say4"),
(3667,5,0,"安娜雅那柔和的声音在薄雾中轻轻回响，“我永远爱你......”",16,0,100,0,0,0,"3667_say5");

DELETE FROM `creature_text` WHERE `entry` = 3644;
INSERT INTO `creature_text` VALUES
(3644,0,0,"安娜雅.....?我的双眼没有欺骗我吗？真的是你吗？",12,0,100,1,0,0,"3644_say0"),
(3644,1,0,"命运是如此残酷，它让我们再分别了数千年之后才能重逢.....",12,0,100,0,0,0,"3644_say1"),
(3644,2,0,"我的爱人，你恨我吗？我在万般无奈之下摧毁了你的躯壳，因为只有这样才能让你从痛苦中永久地解脱。",12,0,100,0,0,0,"3644_say2"),
(3644,3,0,"不！安娜雅.....安娜雅！请不要离开我！不......",14,0,100,0,0,0,"3644_say3"),
(3644,4,0,"怎么办，我的爱人？没有你，我怎么办......没有你......我如何有勇气在这个世界上生存........",12,0,100,18,0,0,"3644_say4");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 3644;
INSERT INTO `smart_scripts` VALUES
(3644,0,0,0,20,0,100,1,963,0,0,0,80,364400,0,0,0,0,0,1,0,0,0,0,0,0,0,"完成任务运行脚本");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 364400;
INSERT INTO `smart_scripts` VALUES
(364400,9,0,0,0,0,100,1,2000,2000,0,0,12,3667,2,42000,0,0,0,8,0,0,0,6425.59,602.56,9.46,4.395,"召唤安娜雅"),
(364400,9,1,0,0,0,100,1,2000,2000,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line0"),
(364400,9,2,0,0,0,100,1,8000,8000,0,0,1,1,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line1"),
(364400,9,3,0,0,0,100,1,5000,5000,0,0,1,2,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line2"),
(364400,9,4,0,0,0,100,1,15000,15000,0,0,1,3,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line3"),
(364400,9,5,0,0,0,100,1,15000,15000,0,0,1,4,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line4");


DELETE FROM `smart_scripts` WHERE `entryorguid` = 3667;
INSERT INTO `smart_scripts` VALUES
(3667,0,0,0,0,0,100,0,3000,5000,14000,17000,11,5884,0,0,0,0,0,2,0,0,0,0,0,0,0,"Anaya Dawnrunner - Cast Banshee Curse"),
(3667,0,1,0,6,0,100,1,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,"Anaya Dawnrunner - Say on Death"),
(3667,0,2,3,54,0,100,1,0,0,0,0,2,35,0,0,0,0,0,1,0,0,0,0,0,0,0,"召唤后切换阵营"),
(3667,0,3,0,61,0,100,1,0,0,0,0,80,366700,0,0,0,0,0,1,0,0,0,0,0,0,0,"召唤后运行脚本");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 366700;
INSERT INTO `smart_scripts` VALUES
(366700,9,0,0,0,0,100,1,5000,5000,0,0,1,1,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line1"),
(366700,9,1,0,0,0,100,1,15000,15000,0,0,1,2,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line2"),
(366700,9,2,0,0,0,100,1,5000,5000,0,0,1,3,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line3"),
(366700,9,3,0,0,0,100,1,10000,10000,0,0,1,4,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line4"),
(366700,9,4,0,0,0,100,1,5000,5000,0,0,1,5,0,0,0,0,0,1,0,0,0,0,0,0,0,"3644_say_line5");



























UPDATE `creature_template` SET AIName='SmartAI' WHERE `entry` = 1842;
UPDATE `creature_template` SET AIName='SmartAI' WHERE `entry` = 1840;
UPDATE `creature_template` SET AIName='SmartAI' WHERE `entry` = 1855;

UPDATE `quest_template` SET `SpecialFlags` = 0  WHERE `Id` = 5944;
UPDATE `quest_template` SET `flags` = 8  WHERE `Id` = 5944;
UPDATE `quest_template` SET `RequiredNpcOrGo1`= 1855  WHERE `Id` = 5944;
UPDATE `quest_template` SET `RequiredNpcOrGoCount1` = 1  WHERE `Id` = 5944;
UPDATE `quest_template` SET ObjectiveText1 = '帮助泰兰找到提里奥·佛丁。' WHERE `Id` = 5944;

DELETE FROM `creature_text` WHERE `entry` = 1842;
INSERT INTO `creature_text` VALUES
(1842,0,0,"不要挡我回家的路，你们这帮混蛋！",12,0,100,0,0,0,"1842_say0"),
(1842,1,0,"伊森利恩,我要通过这里,去见我父亲!",14,0,100,25,0,0,"1842_say1"),
(1842,2,0,"父亲...儿子不能再...再见到...",12,0,100,0,0,0,"1842_say2");

DELETE FROM `creature_text` WHERE `entry` = 1840;
INSERT INTO `creature_text` VALUES
(1840,0,0,"你太让我失望了,泰兰！",14,0,100,0,0,0,"1840_say0"),
(1840,1,0,"你肮脏的血统最终表露出来,只是个时间问题！",14,0,100,0,0,0,"1840_say1");

DELETE FROM `creature_text` WHERE `entry` = 1855;
INSERT INTO `creature_text` VALUES
(1855,0,0,"伊森利恩,你都做了些什么!以前你为荣誉而战,为人民的幸福而战,而现在你杀了我的孩子！",14,0,100,0,0,0,"1855_say0"),
(1855,1,0,"泰兰,我的孩子，看看他们都对你做了什么！",14,0,100,0,0,0,"1855_say1");

DELETE FROM `waypoints` WHERE `entry` = 1842;
INSERT INTO `waypoints` VALUES
(1842,1,2932.129,-1409.99,165.9,"NPC1842"),
(1842,2,2916.43,-1402.02,165.0,"NPC1842"),
(1842,3,2925.14,-1385.42,160.84,"NPC1842"),
(1842,4,2946.64,-1396.2,160.84,"NPC1842"),
(1842,5,2953.46,-1383.56,155.9,"NPC1842"),
(1842,6,2942.97,-1377.73,152.02,"NPC1842"),
(1842,7,2935.36,-1391.7,152.02,"NPC1842"),
(1842,8,2921.35,-1387.98,152.02,"NPC1842"),
(1842,9,2915.6,-1395.046,152.02,"NPC1842"),
(1842,10,2934.03,-1406.95,152.02,"NPC1842"),
(1842,11,2927.55,-1419.5,150.78,"NPC1842"),
(1842,12,2912.077,-1446.842,148.7,"NPC1842"),
(1842,13,2862.57,-1444.89,145.83,"NPC1842"),
(1842,14,2790.34,-1525.49,143.723,"NPC1842"),
(1842,15,2759.71,-1566.8,132.32,"NPC1842"),
(1842,16,2775.32,-1610.58,128.9,"NPC1842"),
(1842,17,2750.83,-1646.17,127.47,"NPC1842"),
(1842,18,2715.63,-1697.54,126.146,"NPC1842"),
(1842,19,2688.99,-1744.92,112.87,"NPC1842"),
(1842,20,2694.51,-1799.79,90.09,"NPC1842"),
(1842,21,2701.81,-1851.74,70.05,"NPC1842"),
(1842,22,2675.19,-1897.64,65.99,"NPC1842"),
(1842,23,2664.05,-1900.17,67.28,"NPC1842"),
(1842,24,2670.98,-1909.47,65.9,"NPC1842");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 1827 and `id` = 2;

DELETE FROM `waypoints` WHERE `entry` = 1840;
INSERT INTO `waypoints` VALUES
(1840,1,2679.54,-1920.9,69.5,"NPC1840"),
(1840,2,2668.96,-1905.96,65.638,"NPC1840");

DELETE FROM `waypoints` WHERE `entry` = 1855;
INSERT INTO `waypoints` VALUES
(1855,1,2512.36,-1934.99,95.96,"NPC1855"),
(1855,2,2580.39,-1925.22,82.78,"NPC1855"),
(1855,3,2649.81,-1907.78,70.17,"NPC1855"),
(1855,4,2668.96,-1905.96,65.64,"NPC1855");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 1855;

INSERT INTO `smart_scripts` VALUES
(1855,0,0,0,54,0,100,1,1,0,0,0,53,1,1855,0,0,0,2,1,0,0,0,0,0,0,0,"1855_ST_WP"),
(1855,0,1,0,40,0,100,1,1,1855,0,0,11,472,0,0,0,0,0,1,0,0,0,0,0,0,0,"1842_ride"),
(1855,0,2,3,40,0,100,1,3,1855,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,"arrive_say_line0"),
(1855,0,3,4,61,0,100,1,0,0,0,0,28,0,0,0,0,0,0,11,1840,120,0,0,0,0,0,"去掉buff"),
(1855,0,4,0,61,0,100,1,0,0,0,0,2,113,0,0,0,0,0,1,0,0,0,0,0,0,0,"1855_chg_Faction"),
(1855,0,5,0,0,0,100,1,0,0,0,0,11,17232,0,0,0,0,0,1,0,0,0,0,0,0,0,"虔诚光环"),
(1855,0,6,0,0,0,100,0,5000,10000,7500,12500,11,14518,0,0,0,0,0,2,0,0,0,0,0,0,0,"十字军打击"),
(1855,0,7,0,0,0,100,0,6000,11500,9500,15500,11,13953,0,0,0,0,0,2,0,0,0,0,0,0,0,"神圣打击"),
(1855,0,8,0,0,0,100,0,4000,8500,7100,10500,11,18819,0,0,0,0,0,2,0,0,0,0,0,0,0,"神圣顺劈"),
(1855,0,9,0,2,0,100,0,0,35,0,0,11,69963,0,0,0,0,0,1,0,0,0,0,0,0,0,"强效治疗");

INSERT INTO `smart_scripts` VALUES
(1855,0,10,0,40,0,100,1,4,1855,0,0,80,185500,0,0,0,0,0,1,0,0,0,0,0,0,0,"激活脚本");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 185500;
INSERT INTO `smart_scripts` VALUES
(185500,9,0,0,0,0,100,1,5000,5000,0,0,1,1,0,0,0,0,0,1,0,0,0,0,0,0,0,"1855_say_line1"),
(185500,9,1,0,0,0,100,1,2000,2000,0,0,33,1855,0,0,0,0,0,18,120,0,0,0,0,0,0,"完成任务");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 1842;
INSERT INTO `smart_scripts` VALUES
(1842,0,0,1,19,0,100,1,5944,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,"1842_say_line0"),
(1842,0,1,2,61,0,100,1,0,0,0,0,53,0,1842,0,0,0,2,1,0,0,0,0,0,0,0,"1842_ACC_QUEST_ST_WP"),
(1842,0,2,0,61,0,100,1,0,0,0,0,2,113,0,0,0,0,0,1,0,0,0,0,0,0,0,"1842_chg_Faction"),
(1842,0,3,0,40,0,100,1,18,1842,0,0,11,470,0,0,0,0,0,1,0,0,0,0,0,0,0,"1842_ride"),
(1842,0,4,0,0,0,100,1,0,0,0,0,11,17232,0,0,0,0,0,1,0,0,0,0,0,0,0,"虔诚光环"),
(1842,0,5,0,0,0,100,0,5000,10000,7500,12500,11,14518,0,0,0,0,0,2,0,0,0,0,0,0,0,"十字军打击"),
(1842,0,6,0,0,0,100,0,6000,11500,9500,15500,11,13953,0,0,0,0,0,2,0,0,0,0,0,0,0,"神圣打击"),
(1842,0,7,0,0,0,100,0,4000,8500,7100,10500,11,18819,0,0,0,0,0,2,0,0,0,0,0,0,0,"神圣顺劈"),
(1842,0,8,0,2,0,100,1,0,35,0,0,11,13952,0,0,0,0,0,1,0,0,0,0,0,0,0,"圣光术"),
(1842,0,9,0,40,0,100,1,22,1842,0,0,80,184200,0,0,0,0,0,1,0,0,0,0,0,0,0,"1842_ST_SC");


INSERT INTO `smart_scripts` VALUES
(1842,0,10,11,6,0,100,1,0,0,0,0,1,2,0,0,0,0,0,1,0,0,0,0,0,0,0,"1842_say_line2");
(1842,0,11,0,61,0,100,0,0,0,0,0,12,1855,2,6000000,0,0,0,8,0,0,0,2489.7,-1926.4,103.2,6.17,"召唤佛丁");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 184200;
INSERT INTO `smart_scripts` VALUES
(184200,9,0,0,0,0,100,1,2000,2000,0,0,1,1,0,0,0,0,0,1,0,0,0,0,0,0,0,"1842_say_line1"),
(184200,9,1,0,0,0,100,1,2000,2000,0,0,12,1840,2,6000000,0,0,0,8,0,0,0,2685.076,-1929.277,72.1445,2.2,"召唤伊森利恩"),
(184200,9,2,0,0,0,100,1,0,0,0,0,28,0,0,0,0,0,0,1,0,0,0,0,0,0,0,"下马");

DELETE FROM `smart_scripts` WHERE `entryorguid` = 1840;
INSERT INTO `smart_scripts` VALUES
(1840,0,0,1,54,0,100,1,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,"1840_say_line0"),
(1840,0,1,2,61,0,100,1,0,0,0,0,53,0,1840,0,0,0,2,1,0,0,0,0,0,0,0,"1840_ST_WP"),
(1840,0,2,3,61,0,100,1,0,0,0,0,11,29476,0,0,0,0,0,1,0,0,0,0,0,0,0,"星界护甲"),
(1840,0,3,4,61,0,100,1,0,0,0,0,2,67,0,0,0,0,0,1,0,0,0,0,0,0,0,"1840_chg_Faction"),
(1840,0,4,0,61,0,100,1,0,0,0,0,80,184000,0,0,0,0,0,1,0,0,0,0,0,0,0,"运行脚本"),
(1840,0,5,0,0,0,100,0,6000,11500,9500,15500,11,18807,0,0,0,0,0,2,0,0,0,0,0,0,0,"精神鞭笞"),
(1840,0,6,0,0,0,100,0,4000,8500,7100,10500,11,10947,0,0,0,0,0,2,0,0,0,0,0,0,0,"心灵震爆"),
(1840,0,7,0,0,0,100,0,7000,9500,10100,14500,11,17615,0,0,0,0,0,2,0,0,0,0,0,0,0,"法力燃烧");


DELETE FROM `smart_scripts` WHERE `entryorguid` = 184000;
INSERT INTO `smart_scripts` VALUES
(184000,9,0,0,0,0,100,1,2000,2000,0,0,1,1,0,0,0,0,0,1,0,0,0,0,0,0,0,"1840_say_line1");
























